; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	thermograph2 - mode
	image1 - mode
	thermograph0 - mode
	thermograph3 - mode
	image4 - mode
	Star4 - direction
	Star5 - direction
	Star7 - direction
	GroundStation9 - direction
	Star8 - direction
	Star11 - direction
	GroundStation1 - direction
	Star0 - direction
	Star6 - direction
	GroundStation2 - direction
	Star10 - direction
	GroundStation3 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 thermograph3)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star6)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument2 thermograph3)
	(supports instrument2 image1)
	(supports instrument2 image4)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon14)
	(supports instrument3 thermograph2)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
)
(:goal (and
	(pointing satellite2 GroundStation3)
	(pointing satellite3 Planet18)
	(have_image Star12 image4)
	(have_image Phenomenon13 image1)
	(have_image Phenomenon14 image4)
	(have_image Phenomenon15 image4)
	(have_image Phenomenon16 thermograph3)
	(have_image Phenomenon17 image4)
	(have_image Planet18 image4)
))

)

; plan
1. (turn_to satellite2 groundstation2 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 9
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite2 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite2 phenomenon14 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon14)
   goals met: 0 of 9
5. (take_image satellite2 phenomenon14 instrument2 image4)
   added: (have_image phenomenon14 image4)
   goals met: 1 of 9
6. (turn_to satellite2 phenomenon13 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon13)
   goals met: 1 of 9
7. (take_image satellite2 phenomenon13 instrument2 image1)
   added: (have_image phenomenon13 image1)
   goals met: 2 of 9
8. (turn_to satellite2 phenomenon15 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon15)
   goals met: 2 of 9
9. (take_image satellite2 phenomenon15 instrument2 image4)
   added: (have_image phenomenon15 image4)
   goals met: 3 of 9
10. (turn_to satellite2 phenomenon16 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon16)
   goals met: 3 of 9
11. (take_image satellite2 phenomenon16 instrument2 thermograph3)
   added: (have_image phenomenon16 thermograph3)
   goals met: 4 of 9
12. (turn_to satellite2 phenomenon17 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon17)
   goals met: 4 of 9
13. (take_image satellite2 phenomenon17 instrument2 image4)
   added: (have_image phenomenon17 image4)
   goals met: 5 of 9
14. (turn_to satellite2 planet18 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 planet18)
   goals met: 5 of 9
15. (take_image satellite2 planet18 instrument2 image4)
   added: (have_image planet18 image4)
   goals met: 6 of 9
16. (turn_to satellite2 star12 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 star12)
   goals met: 6 of 9
17. (take_image satellite2 star12 instrument2 image4)
   added: (have_image star12 image4)
   goals met: 7 of 9
18. (turn_to satellite2 groundstation3 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 groundstation3)
   goals met: 8 of 9
19. (turn_to satellite3 planet18 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 planet18)
   goals met: 9 of 9
